work/log.ltccip8.2020-06-14_0656/pgbench-timed-rw-small/iter-0/pgbench/logs/pgbench-144.log
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 8
query mode: simple
number of clients: 144
number of threads: 4
duration: 300 s
number of transactions actually processed: 122986
latency average = 351.660 ms
tps = 409.486656 (including connections establishing)
tps = 409.499721 (excluding connections establishing)
statement latencies in milliseconds:
         0.002  \set aid random(1, 100000 * :scale)
         0.001  \set bid random(1, 1 * :scale)
         0.001  \set tid random(1, 10 * :scale)
         0.001  \set delta random(-5000, 5000)
         0.130  BEGIN;
         0.336  UPDATE pgbench_accounts SET abalance = abalance + :delta WHERE aid = :aid;
         0.153  SELECT abalance FROM pgbench_accounts WHERE aid = :aid;
       228.830  UPDATE pgbench_tellers SET tbalance = tbalance + :delta WHERE tid = :tid;
       103.658  UPDATE pgbench_branches SET bbalance = bbalance + :delta WHERE bid = :bid;
         0.171  INSERT INTO pgbench_history (tid, bid, aid, delta, mtime) VALUES (:tid, :bid, :aid, :delta, CURRENT_TIMESTAMP);
        17.881  END;