work/log.ltccip8.2020-06-14_0656/pgbench-timed-rw-small/iter-0/pgbench/logs/pgbench-160.log
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 8
query mode: simple
number of clients: 160
number of threads: 4
duration: 300 s
number of transactions actually processed: 123515
latency average = 389.098 ms
tps = 411.207629 (including connections establishing)
tps = 411.217435 (excluding connections establishing)
statement latencies in milliseconds:
         0.002  \set aid random(1, 100000 * :scale)
         0.001  \set bid random(1, 1 * :scale)
         0.001  \set tid random(1, 10 * :scale)
         0.001  \set delta random(-5000, 5000)
         0.128  BEGIN;
         0.396  UPDATE pgbench_accounts SET abalance = abalance + :delta WHERE aid = :aid;
         0.153  SELECT abalance FROM pgbench_accounts WHERE aid = :aid;
       263.696  UPDATE pgbench_tellers SET tbalance = tbalance + :delta WHERE tid = :tid;
       106.277  UPDATE pgbench_branches SET bbalance = bbalance + :delta WHERE bid = :bid;
         0.170  INSERT INTO pgbench_history (tid, bid, aid, delta, mtime) VALUES (:tid, :bid, :aid, :delta, CURRENT_TIMESTAMP);
        17.743  END;