work/log.ltccip8.2020-06-14_0656/pgbench-timed-rw-small/iter-0/pgbench/logs/pgbench-32.log
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 8
query mode: simple
number of clients: 32
number of threads: 4
duration: 300 s
number of transactions actually processed: 117934
latency average = 81.425 ms
tps = 392.997978 (including connections establishing)
tps = 393.002220 (excluding connections establishing)
statement latencies in milliseconds:
         0.002  \set aid random(1, 100000 * :scale)
         0.001  \set bid random(1, 1 * :scale)
         0.001  \set tid random(1, 10 * :scale)
         0.001  \set delta random(-5000, 5000)
         0.082  BEGIN;
         0.211  UPDATE pgbench_accounts SET abalance = abalance + :delta WHERE aid = :aid;
         0.131  SELECT abalance FROM pgbench_accounts WHERE aid = :aid;
        21.650  UPDATE pgbench_tellers SET tbalance = tbalance + :delta WHERE tid = :tid;
        42.246  UPDATE pgbench_branches SET bbalance = bbalance + :delta WHERE bid = :bid;
         0.133  INSERT INTO pgbench_history (tid, bid, aid, delta, mtime) VALUES (:tid, :bid, :aid, :delta, CURRENT_TIMESTAMP);
        17.040  END;