work/log.ltccip8.2020-06-14_0656/pgbench-timed-rw-small/iter-0/pgbench/logs/pgbench-48.log
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 8
query mode: simple
number of clients: 48
number of threads: 4
duration: 300 s
number of transactions actually processed: 120478
latency average = 119.610 ms
tps = 401.303201 (including connections establishing)
tps = 401.307649 (excluding connections establishing)
statement latencies in milliseconds:
         0.002  \set aid random(1, 100000 * :scale)
         0.001  \set bid random(1, 1 * :scale)
         0.001  \set tid random(1, 10 * :scale)
         0.001  \set delta random(-5000, 5000)
         0.095  BEGIN;
         0.233  UPDATE pgbench_accounts SET abalance = abalance + :delta WHERE aid = :aid;
         0.135  SELECT abalance FROM pgbench_accounts WHERE aid = :aid;
        44.272  UPDATE pgbench_tellers SET tbalance = tbalance + :delta WHERE tid = :tid;
        57.492  UPDATE pgbench_branches SET bbalance = bbalance + :delta WHERE bid = :bid;
         0.142  INSERT INTO pgbench_history (tid, bid, aid, delta, mtime) VALUES (:tid, :bid, :aid, :delta, CURRENT_TIMESTAMP);
        17.308  END;